Revit 2025 API
WaterType Enumeration
 The enumerated type representing the permitted values for the asset property "WaterType" from the "Water" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum WaterType
Public Enumeration WaterType
public enum class WaterType
type WaterType
Members
Member name | Value | Description
SwimmingPool | 0
ReflectingPool | 1
River | 2
Lake | 3
Ocean | 4
See Also
Reference
Autodesk.Revit.DB.Visual Namespace